## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                       |
|----------|--------------------------------------------------|
| add      | `aws_security_group_rule.database_ingress_ecs`   |
|          | `aws_security_group_rule.ecs_egress_database`    |
| update   | `aws_security_group.ecs_tasks`                   |
|          | `module.ai_answers.aws_ecs_service.this`         |
| recreate | `module.ai_answers.aws_ecs_task_definition.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow ECS security group to send all traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ]
        id                     = "sg-085c606383f33733e"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow the ecs security group to receive traffic only from the load balancer on port 3001"
              - from_port        = 3001
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-08e35f1019824d56a",
                ]
              - self             = false
              - to_port          = 3001
            },
        ]
        name                   = "ai-answers-security-group"
        tags                   = {
            "CostCentre" = "ai-answers-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.database_ingress_ecs will be created
  + resource "aws_security_group_rule" "database_ingress_ecs" {
      + description              = "Allow DocumentDB cluster to receive requests from ECS"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-04966047bf236b850"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-085c606383f33733e"
      + to_port                  = 27017
      + type                     = "ingress"
    }

  # aws_security_group_rule.ecs_egress_database will be created
  + resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the DocumentDB cluster"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-085c606383f33733e"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-04966047bf236b850"
      + to_port                  = 27017
      + type                     = "egress"
    }

  # module.ai_answers.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "ai-answers-task"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.ai_answers.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:992382783569:service/ai-answers-cluster/ai-answers-app-service"
        name                               = "ai-answers-app-service"
        tags                               = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task:10" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ai_answers.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:992382783569:task-definition/ai-answers-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment            = []
                    name                   = "ai-answers"
                  ~ secrets                = [
                      + {
                          + name      = "AZURE_OPENAI_API_KEY"
                          + valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/azure_openai_api_key"
                        },
                      + {
                          + name      = "AZURE_OPENAI_API_VERSION"
                          + valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/azure_openai_api_version"
                        },
                      + {
                          + name      = "AZURE_OPENAI_ENDPOINT"
                          + valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/azure_openai_endpoint"
                        },
                        {
                            name      = "DOCDB_URI"
                            valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/docdb_uri"
                        },
                      - {
                          - name      = "OPENAI_API_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:992382783569:parameter/openai_api_key"
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "ai-answers-task" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
